emacs/Emacs.org
#+title: Jhon Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Welcome

This is a configuration for my emacs setup. I've been following the [[https://www.youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ][Emacs from scratch]] playlist, if it's your first time in emacs, I also recommend going over that.


* Performance

#+begin_src emacs-lisp

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun jhon/display-startup-time ()
      (message "Emacs loaded in %s with %d garbage collections."
              (format "%.2f seconds"
                      (float-time
                          (time-subtract after-init-time before-init-time)))
              gcs-done))

  (add-hook 'emacs-startup-hook #'jhon/display-startup-time)

#+end_src

** Don't write backup or temp files dammit

#+begin_src emacs-lisp

  (setq make-backup-files nil)
  (setq create-lockfiles nil)

#+end_src


* Fonts

** Default font sizes

#+begin_src emacs-lisp

    (defvar jhon/default-font-size 120)
    (defvar jhon/default-variable-font-size 120)

    ;; Make frame transparency overridable
    (defvar jhon/frame-transparency '(90 . 90))

#+end_src

** Font Configuration

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font "JetBrains Mono" :height jhon/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "JetBrains Mono" :height jhon/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "JetBrains Mono" :height jhon/default-variable-font-size :weight 'regular)

#+end_src


* Overall config

** Packages
Emacs has a built in package manager but it doesn’t make it easy to automatically install packages on a new system the first time you pull down your configuration. use-package is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

#+begin_src emacs-lisp

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                          ("org" . "https://orgmode.org/elpa/")
                          ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
      (package-install 'use-package))

  (require 'use-package)
    (setq use-package-always-ensure t)

#+end_src

** Automatic updates
The auto-package-update package helps us keep our Emacs packages up to date! It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use M-x auto-package-update-now to update right now!
#+begin_src emacs-lisp

    (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

** Keep folders clean
We use the no-littering package to keep folders where we edit files and the Emacs configuration folder clean! It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp

    ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
    ;; reliably, set `user-emacs-directory` before loading no-littering!
    ;(setq user-emacs-directory "~/.cache/emacs")

    (use-package no-littering)

    ;; no-littering doesn't set this by default so we must place
    ;; auto save files in the same path as it uses for sessions
    (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

** Basic UI Config

#+begin_src emacs-lisp

      (setq inhibit-startup-message t)

      (scroll-bar-mode -1)        ; Disable visible scrollbar
      (tool-bar-mode -1)          ; Disable the toolbar
      (tooltip-mode -1)           ; Disable tooltips
      (set-fringe-mode 10)        ; Give some breathing room

      (menu-bar-mode -1)            ; Disable the menu bar

      ;; Set up the visible bell
      (setq visible-bell t)

      (column-number-mode)
      (global-display-line-numbers-mode t)
      (setq display-line-numbers 'relative)

      (set-window-margins nil 0)

      (setq right-divider-width 0
            bottom-divider-width 0)

      (load-theme 'wombat)

      ;; Make ESC quit prompts
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

      ;; Set frame transparency
      (set-frame-parameter (selected-frame) 'alpha jhon/frame-transparency)
      (add-to-list 'default-frame-alist `(alpha . ,jhon/frame-transparency))
      (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
      (add-to-list 'default-frame-alist '(fullscreen . maximized))

    ;; Disable line numbers for some modes
    (dolist (mode '(org-mode-hook
                    term-mode-hook
                    shell-mode-hook
                    treemacs-mode-hook
                    eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Emojis

#+begin_src emacs-lisp
(use-package emojify
  :hook (erc-mode . emojify-mode)
  :commands emojify-mode)
#+end_src 

** Highlighting pairs

#+begin_src emacs-lisp

  (use-package paren
    :config
    (set-face-attribute 'show-paren-match-expression nil :background "#E8DCCA")
    (show-paren-mode 1))

#+end_src



** Colorscheme
Using doom themes
#+begin_src emacs-lisp

  (use-package doom-themes
      :init
      (load-theme 'doom-one t)
      (global-hl-line-mode +1)
      :custom
      (doom-themes-visual-bell-config)
      ;; Enable custom neotree theme (all-the-icons must be installed!)
      (doom-themes-neotree-config)
      (doom-themes-org-config)
  )

  (custom-set-faces
   `(fringe ((t (:background nil)))))

#+end_src

** Modeline

#+begin_src emacs-lisp

  (use-package all-the-icons)

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

#+end_src

** Which key

which-key is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix. For example, if you press C-c (hold control and press the letter c), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run. This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3))

#+end_src

** Avy for jumping around

#+begin_src emacs-lisp

  (use-package avy
    :commands (avy-goto-char avy-goto-word-0 avy-goto-line))

#+end_src


* Keybindings


*** Evil Mode
vim like keybindings
#+begin_src emacs-lisp

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

*** GeneralKeys & Hydra
Hydra is for showing keybindings as well

#+begin_src emacs-lisp

    ;; unmap f1 - will use for global mode
    (global-set-key (kbd "<f1>") nil)

    (use-package general
      :after evil
      :config
      (general-create-definer jhon/leader-keys
        :keymaps '(normal insert visual emacs)
        :prefix "SPC"
        :global-prefix "<f1>"
        )

      (general-create-definer jhon/normal-keys
        :keymaps '(normal)
        :prefix "")
    )

    (use-package hydra
        :defer t
    )

#+end_src

*** Leader keys

#+begin_src emacs-lisp

  (jhon/leader-keys
    "." '(find-file :which-key "Find Files")
    "a"  '(hydra-agenda-menu/body :which-key "Agenda")
    "b"  '(hydra-bookmarks-menu/body :which-key "Bookmark")
    "c"  '(org-capture :which-key "Quick Capture")
    "d"  '(hydra-dap-menu/body :which-key "Bookmark")
    "e"  '(neotree-toggle :which-key "Neotree explorer")
    "f"  '(hydra-files-menu/body :which-key "Files")
    "l"  '(hydra-lsp-menu/body :which-key "LSP")
    "o"  '(hydra-org-menu/body :which-key "Org")
    "p"  '(hydra-perspective-menu/body :which-key "Perspective")
    "r"  '(:ignore t :which-key "Roam")
    "s"  '(hydra-search-menu/body :which-key "Search")
    "t"  '(hydra-text-scale/body :which-key "Text scale")
    "w"  '(hydra-windows-menu/body :which-key "Windows")
  )

#+end_src

