emacs/Emacs.org
*** Keysagenda

#+begin_src emacs-lisp

  (defhydra hydra-agenda-menu (:hint nil)
    "
  ^Agenda^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _a_: Agenda
  _t_: Change status
  _l_: Agenda list
                       ^^                     ^^                             ^^
  "
    ("a" org-agenda :exit t)
    ("t" org-todo :exit t)
    ("l" org-agenda-list :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keysdebugging

#+begin_src emacs-lisp


  (defhydra hydra-dap-menu (:hint nil :color red)
    "
  ^DAP^               ^Interact^        ^Delete^                        ^Hydra
  ^^^^^^^^----------------------------------------------------------------------------------------
  _d_: Debug last     _n_:  Next        _xx_: Delete all                _hh_: Dap hydra
  _t_: Breakpoint     _r_:  Restart     _xq_: Disconnect
  _m_: Message        _cc_: Continue
  ^^                  _cn_: Console
  ^^                  _e_:  Add expression

  "
    ("d" dap-debug-last :color blue)
    ("t" dap-breakpoint-toggle :color blue)
    ("m" dap-breakpoint-log-message)
    ("n" dap-next)
    ("r" dap-debug-restart)
    ("cc" dap-ui-continue)
    ("cn" dap-ui-repl :color blue)
    ("xq" dap-disconnect :color blue)
    ("xx" dap-delete-all-sessions)
    ("e" dap-ui-expressions-add)

    ("hh" dap-hydra)

    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keysfiles

#+begin_src emacs-lisp

  (defhydra hydra-files-menu (:hint nil :color red)
    "
  ^Local^                           ^Common files
  ^^^^^^^^----------------------------------------------------------------------------------------
  _f_: file in dir                  _de_: Go to Emacs.org
  _g_: rg dir                       _dt_: Go to Tasks.org
  _p_: find preview
  _b_: buffer
  _c_: themes
  ^^

  "
    ("f" consult-find :exit t)
    ("g" consult-ripgrep :exit t)
    ("p" jhon/find-file-preview :exit t)
    ("b" consult-buffer :exit t)
    ("c" consult-theme)

    ("de" (lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org"))) :exit t)
    ("dt" (lambda () (interactive) (find-file (expand-file-name "/storage/org/todo/Tasks.org"))) :exit t)

    ("q" nil "quit" :color blue)
  )

  (jhon/leader-keys
    "SPC"  '(consult-line :which-key "consult-line")
  )
#+end_src

*** Jump
#+begin_src emacs-lisp

  (defun jhon/avy-goto-char-timer-highlight()
    (interactive)
    (let ((current-prefix-arg t)) (evil-avy-goto-char-timer))
  )

  (jhon/normal-keys
    "gs" '(jhon/avy-goto-char-timer-highlight :which-key "jump to char with highlight")
    "s" '(avy-goto-char-timer :which-key "char")
  )

#+end_src

*** Keyssscale

#+begin_src emacs-lisp

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t)
   )

#+end_src

**** Helpers

#+begin_src emacs-lisp

  (defun jhon/org-file-jump-to-heading (org-file heading-title)
    (interactive)
    (find-file (expand-file-name org-file))
    (goto-char (point-min))
    (search-forward (concat "* " heading-title))
    (org-overview)
    (org-reveal)
    (org-show-subtree)
    (forward-line))

  (defun jhon/org-file-show-headings (org-file)
    (interactive)
    (find-file (expand-file-name org-file))
    (counsel-org-goto)
    (org-overview)
    (org-reveal)
    (org-show-subtree)
    (forward-line))

#+end_src

*** Keysperspective
#+begin_src emacs-lisp

  (defhydra hydra-perspective-menu (:hint nil)
    "
  ^Perspective^         ^Buffer^                 ^State^                        ^Delete
  ^^^^^^^^----------------------------------------------------------------------------------------
  _p_: Go to persp     _a_: Add to buffer       _ss_: State save               _xt_: Kill this
  _n_:  Next            _b_: Choose which buffer _sl_: State load               _xo_: Kill others
  _fb_: Search          ^^                       ^^                             ^^
                        ^^                       ^^                             ^^
  "
    ("p" persp-switch :exit t)
    ("fb" switch-to-buffer :exit t)
    ("n" persp-next :exit t)
    ("a" persp-add-buffer)
    ("b" persp-set-buffer)
    ("xt" persp-kill)
    ("xo" persp-kill-others)
    ("ss" persp-state-save :exit t)
    ("sl" persp-state-load :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keyssorg

#+begin_src emacs-lisp

  (defhydra hydra-org-menu (:hint nil)
    "
  ^Code^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _cb_: Compile Block
  _cc_: Compile elisp

  "
    ("cb" org-ctrl-c-ctrl-c :exit t)
    ("cc" eval-last-sexp :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keyslsp

#+begin_src emacs-lisp

  (defhydra hydra-lsp-menu (:hint nil)
    "
  ^Diagnostics^              ^Python^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _i_: Show diagnostics      _ve_: Pyenv
  _a_: Show code actions
                             ^^
  "
    ("i" flycheck-list-errors :exit t)
    ("a" lsp-ui-sideline-apply-code-actions :exit t)
    ("ve" pyvenv-workon :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keysbookmarks

#+begin_src emacs-lisp

  (defhydra hydra-bookmarks-menu (:hint nil)
    "
  ^Bookmarks^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _s_: Set bookmark
  _b_: Consult bookmark
  _x_: Delete bookmark
                           ^^
  "
    ("b" consult-bookmark :exit t)
    ("s" bookmark-set :exit t)
    ("x" bookmark-delete :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src

*** Keyswindows

#+begin_src emacs-lisp

  (defhydra hydra-windows-menu (:hint nil :color red)
    "
  ^Windows^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _r_: Split right
  _b_: Split bellow
  _d_: Delete window
  _s_: Shrink
  _e_: Enlarge
  _w_: Recenter
                           ^^
  "

    ("w" recenter :exit t)
    ("d" delete-window :exit t)
    ("l" evil-window-right :exit t)
    ("h" evil-window-left :exit t)
    ("k" evil-window-up :exit t)
    ("j" evil-window-down :exit t)

    ("r" evil-window-vsplit :color blue)
    ("b" evil-window-split :color blue)

    ("s" shrink-window-horizontally)
    ("e" enlarge-window-horizontally)

    ("q" nil "quit" :color blue)
  )

#+end_src

*** Search files

#+begin_src emacs-lisp

  (defhydra hydra-search-menu (:hint nil)
    "
  ^Bookmarks^
  ^^^^^^^^----------------------------------------------------------------------------------------
  _n_: Search my org roam notes
  _p_: Search /storage/projects
                           ^^
  "
    ("n" jhon/org-roam-rg-search :exit t)
    ("p" jhon/search-projects :exit t)
    ("q" nil "quit" :color blue)
  )

#+end_src


* Org mode

Org Mode is one of the hallmark features of Emacs. It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Basic config

