emacs/init.el
  (setq outline-blank-line t)

  (defun jhon/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . jhon/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-src-fontify-natively t)
    ;org-agenda
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)


    (setq org-agenda-files
    '("/storage/org/todo/Tasks.org"
     "/storage/org/todo/Bills.org"
     "/storage/org/todo/Birthdays.org"
     "/storage/org/journal/Habits.org"))

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
  '((sequence "TODO(t)" "NEXT(n)" "PROCESS(pr)" "|" "DONE(d!)")
    (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

      (setq org-todo-keyword-faces
          '(
            ("TODO" . org-warning) ("NEXT" . "yellow")
            ("PLAN" . "orange") ("WAIT" . "yellow")
            ("CANC" . "red") ("READY" . "green")
            ("ACTIVE" . "green") ("HOLD" . "red")
            ("BACKLOG" . "gray") ("PROCESS" . "yellow")
           )
      )

    (setq org-agenda-custom-commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 7)))
              (todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))
              (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

            ("n" "Next Tasks"
             ((todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))))
            )
    )

    (setq org-capture-templates
      '(
          ("t" "Tasks / Projects")
          ("tt" "Task" entry (file+olp "/storage/org/todo/Tasks.org" "Inbox")
              "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

          ("j" "Journal")
          ("jj" "Journal" entry
          (file+olp+datetree "/storage/org/journal/Journal.org")
          "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
          ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
          :clock-in :clock-resume
          :empty-lines 1)
       )
    )

)

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
)
(with-eval-after-load 'org-faces
  (set-face-attribute 'org-document-title nil :font "JetBrains Mono" :weight 'bold :height 1.3)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "JetBrains Mono" :weight 'medium :height (cdr face)))
)

;; Make sure org-indent face is available
(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
;;(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
;;(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
;;(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;; Get rid of the background on column views
(set-face-attribute 'org-column nil :background nil)
(set-face-attribute 'org-column-title nil :background nil)

(defun jhon/org-mode-visual-fill ()
  (setq visual-fill-column-width 140
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . jhon/org-mode-visual-fill)
  )

(with-eval-after-load 'org
  (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (python . t)
      )
    )
  (push '("conf-unix" . conf-unix) org-src-lang-modes)
)

;; Automatically tangle our Emacs.org config file when we save it
(defun jhon/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jhon/org-babel-tangle-config)))

(defun my-org-confirm-babel-evaluate (lang body)
  (not (member lang '("python" "typescript"))))

(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

(use-package org-roam
   :ensure t
   :init
   (setq org-roam-v2-ack t)
   :custom
   org-roam-directory "/storage/roam"
   org-roam-completion-everywhere

   (org-roam-capture-templates
    '(("d" "default" plain
        "%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)

      ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
       :unnarrowed t)

      ))
   :bind (:map org-mode-map ("C-M-i" . completion-at-point))
   :config
   (org-roam-setup)
   (require 'org-roam-dailies) ;; Ensure the keymap is available
   (org-roam-db-autosync-mode)
 )


(defun org-roam-node-insert-immediate (arg &rest args)
(interactive "P")
(let ((args (cons arg args))
      (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                '(:immediate-finish t)))))
  (apply #'org-roam-node-insert args)))


(jhon/leader-keys
 "rb"  'org-roam-buffer-toggle
 "rf"  'org-roam-node-find
 "ri"  'org-roam-node-insert-immediate
 "rz"  'font-lock-mode
 "rd"  'org-roam-dailies-capture-today
 "ro"  'org-open-at-point
)

(require 'org-roam-node)

(setq read-process-output-max (* 1024 1024))

(defun jhon/org-roam-rg-search ()
  "Search org-roam directory using consult-ripgrep. With live-preview."
  (interactive)
  (let ((consult-ripgrep-command "rg --multiline --null --ignore-case --type org --line-buffered --color=always --max-columns=500 --no-heading --line-number . -e ARG OPTS"))
    (consult-ripgrep "/storage/roam")))

(defun jhon/search-projects()
  (interactive)
  (let ((consult-ripgrep-command "rg --multiline --null --ignore-case --type org --line-buffered --color=always --max-columns=500 --no-heading --line-number . -e ARG OPTS"))
    (consult-ripgrep "/storage/projects")))
